[Reward_RemoveDE X2RewardTemplate]
DisplayName="Remove Active Dark Event"

[CovertActionNarrative_PrepareDark_Skirmishers X2CovertActionNarrativeTemplate]
ActionName="Investigate Dark Event"
ActionPreNarrative="Our freedom suffers from a nearby Dark Event (<font color='#E52E11'><XGParam:StrValue4/!DarkEventName/></font>), Commander. The Skirmishers can not allow this to continue..."
ActionPostNarrative="We have found the center of operation of this Dark Event. It is time."

[CovertActionNarrative_PrepareDark_Reapers X2CovertActionNarrativeTemplate]
ActionName="Investigate Dark Event"
ActionPreNarrative="We hear whispers of a Dark Event (<font color='#E52E11'><XGParam:StrValue4/!DarkEventName/></font>) nearby.  We should send some operatives to investigate."
ActionPostNarrative="We have found the center of operation of this Dark Event. It is time."

[CovertActionNarrative_PrepareDark_Templars X2CovertActionNarrativeTemplate]
ActionName="Investigate Dark Event"
ActionPreNarrative="Shudders from the Void tell of a nearby Dark Event (<font color='#E52E11'><XGParam:StrValue4/!DarkEventName/></font>). Let us illuminate this vicious scheme."
ActionPostNarrative="We have found the center of operation of this Dark Event. It is time."